// Lab_03_4.cpp
// Пастернак Олександр
// Лабораторна робота № 3.4
// Розгалуження, задане плоскою фігурою.
// Варіант 0.23

#include <iostream>
using namespace std;

int main()
{
    double x;  // вхідний аргумент
    double y;  // вхідний аргумент
    double R;  // вхідний параметр (радіус кола)

    cout << "x = "; cin >> x;
    cout << "y = "; cin >> y;
    cout << "R = "; cin >> R;

    // розгалуження в скороченій формі
    if ((x >= -R && x <= R && y >= -R && y <= R)   // у великому квадраті
        && ((x + R) * (x + R) + (y - R) * (y - R) >= R * R)   // рівняння кола з центром (a; b): (x − a)² + (y − b)² = R. поза колом 1, центр (-R; R) 
        && ((x - R) * (x - R) + (y + R) * (y + R) >= R * R))  // поза колом 2, центр (R; -R)
        cout << "yes" << endl;
    else
        cout << "no" << endl;

    cin.get();
    return 0;
}